## Plan Result (staging-staging)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.staging-hmcts-justice-gov-uk.azurerm_private_dns_zone.zone[0]
  * module.staging-hmcts-justice-gov-uk.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-nonprodi&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.staging-hmcts-justice-gov-uk.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "staging.hmcts.justice.gov.uk"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.staging-hmcts-justice-gov-uk.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-nonprodi"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-nonprodi"
      + private_dns_zone_name = "staging.hmcts.justice.gov.uk"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/private-dns-resolver-uksouth-nonprodi/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-nonprodi"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":480,"Program":"tfcmt","SHA1":"","Target":"staging-staging","Vars":{}} -->